FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
#include <WiFi.h>
#include <ESPmDNS.h>
#include <ESP32AVRISP.h>
#include <WebServer.h>

#include "Fluoweb.h"
#include "Fluohtml.h"
#include "Fluotools.h"
#include "FluoSD.h"
#include "EEPROM.h"
#include "644VirtualCom/protocol.h"

WebServer serverIoT(80);

WebServer serverMANUAL(8080);

WiFiServer serverWIFI(80); 

WiFiCallbackClass WiFiCallback;


//CheckMode
enum{
  STA = 1,
  AP,
  APSTA
};
//CheckStatus
enum{
  WAIT,
  CONNECTED,
  CONNECTED_NOWAN,
  SSID_NOVALID,
  PASSKEY_NOVALID,
  FAILURE
};
//struct for args
struct Args
{
    char key;
    char *value;  
};
struct Args WifisaveArg[5];

struct settings_t{
  byte  IoTMode;
  char hostname[31];
  char ssid[31];
  char password[64];
};
struct settings_t settings = {0, "fluo", "ssid", "pass"};

// Function Prototype 
int getRSSIasQuality(int);
void PopulateArgsArrey(char *);
void AP_SettingMode();
void STA_SettingMode();
void MANUAL_SettingMode();
void ActivateManualMode();
void RESThandle();
void WiFiEvent(WiFiEvent_t);
int ComputeBar(int);

void ReadSetting(struct settings_t *);
void storeStruct(void *, size_t);
void loadStruct(void *, size_t);

// Global Variable
//System
unsigned long prevMillisTaskWiFiCheck;
//Web
int RefreshPageMode = 1; //parte attivo

const char* APssid = "FLUO WI-FI (FirstConfig)"; //default on Start
int CheckStatus; // link to enum
int CheckMode;   // link to enum
int NETnumber; // 

int oneshot; 
int RetryCount;

int MMMode;

void WebSetup(void)
{  
	HardwareInit();

    // WiFi Setting - occhio !!!
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);

    Serial.println("ESP32 Application Start");
  
    delay(10);

    WiFi.onEvent(WiFiEvent); // start

    delay(2000);

    // read configuration from EEPROM and save it on RAM -> settings
    loadStruct(&settings, sizeof(settings));
    ReadSetting(&settings); //dbg

    struct settings_t *struct_pointer_tmp = &settings;

    if (struct_pointer_tmp->IoTMode == 1)
      WiFiCallback.STAmode();
    else
      WiFiCallback.APmode();
}

byte ManualMode;

void ActivateManualMode()
{

    //WiFi.mode(WIFI_MODE_STA);
    //Serial.println("[ManualMODE] STA mode and try to connect");

    String hostname = VirtualHOSTNAME(); // hostname
    delay(100);
    String passkey = VirtualPASSKEY(); // passkey
    delay(100);
    String ssid = VirtualSSID(); // ssid
    delay(100);

    Serial.println(hostname); Serial.println(passkey); Serial.println(ssid);

    WiFi.mode(WIFI_MODE_STA);
    delay(1000);

    //Try to connect
    WiFi.begin(ssid.c_str(), passkey.c_str());
    ManualMode = 1;

    int i = 0;
    // max 10 tentativi (5 sec)
    while ( (WiFi.status() != WL_CONNECTED) && (i <= 15) ) 
    {
        delay(500);
        //Serial.print(i); DBG
        i++;
    }

    VirtualConnection(WiFi.localIP().toString());

    if (i >= 15) // non provare a configurare MDNS
        return;

    if (!MDNS.begin(hostname.c_str())) 
        Serial.println("[ManualMODE] Error setting up MDNS responder!");

    Serial.println("[ManualMODE] mDNS responder started");

    //Add service to MDNS-WEB
    MDNS.addService("http", "tcp", 80);

    delay(500); 
}

void WebLoop(void)
{
    struct settings_t *struct_pointer_tmp = &settings;

    if (MMMode == 2)
    {
        ActivateManualMode();
        Scheduler(); //force
        return;
    }

    if (ManualMode == 1 && MMMode == 1)
    {
        MANUAL_SettingMode();
        Scheduler(); //force
        return;
    }

    // IoT Panel

    if (CheckInterrupt() == 1)
    {
    	WiFiCallback.APmode();

        delay(1000);
        ESP.restart();
    }
          
    if (struct_pointer_tmp->IoTMode == 1)
        STA_SettingMode();
    else
        AP_SettingMode();

    // if only free time ?
    Scheduler();
}


//--------------------------------------------------------
// WiFiCallbackClass
void WiFiCallbackClass::APmode()
{         
   WiFi.disconnect(true); // delete old config
   
   WiFi.mode(WIFI_MODE_AP);
   Serial.println("[AP - WiFiCallback] AP mode");

   delay(100);

   // Start TCP (HTTP) Server WiFi Configurator
   serverWIFI.begin();
   Serial.println("[AP - WiFiCallback] TCP server started");

   //al reboot la nuova modalita' e' quella AP config
   struct settings_t settings = {0, "fluo", "ssid", "pass"};
   storeStruct(&settings, sizeof(settings));
}

void WiFiCallbackClass::STAmode()
{
   //WiFi.disconnect(true); // delete old config
   struct settings_t *struct_pointer_tmp = &settings;

   WiFi.mode(WIFI_MODE_STA);
   Serial.println("[STA - WiFiCallback] STA mode");

   delay(10);

  //dbg
   Serial.print("[APSTA - WiFiCallback] SSID: ");
   Serial.println(struct_pointer_tmp->ssid);
   Serial.print("[APSTA - WiFiCallback] Passkey: ");
   Serial.println(struct_pointer_tmp->password);

   WiFi.begin(struct_pointer_tmp->ssid, struct_pointer_tmp->password);

   Serial.print("[STA - WiFiCallback] Hostname: ");
   Serial.println(struct_pointer_tmp->hostname);

   if (!MDNS.begin(struct_pointer_tmp->hostname)) 
   {
     Serial.println("[STA - WiFiCallback] Error setting up MDNS responder!");
   }
   Serial.println("[STA - WiFiCallback] mDNS responder started");

   //Add service to MDNS-WEB
   MDNS.addService("http", "tcp", 80);

   delay(100);

   Serial.println("[STA - WiFiCallback] TCP server started");

   //al reboot la nuova modalita' e' quella IoT
   settings.IoTMode = 1;
   storeStruct(&settings, sizeof(settings));
} 

void WiFiCallbackClass::APSTAmode()
{
   WiFi.mode(WIFI_MODE_APSTA);
   
   delay(100);

   struct settings_t *struct_pointer_tmp = &settings;

   //dbg
   Serial.print("[APSTA - WiFiCallback] SSID: ");
   Serial.println(struct_pointer_tmp->ssid);
   Serial.print("[APSTA - WiFiCallback] Passkey: ");
   Serial.println(struct_pointer_tmp->password);

   delay(100);

   WiFi.begin(struct_pointer_tmp->ssid, struct_pointer_tmp->password);


   Serial.println("[AP+STA - WiFiCallback] AP+STA mode");
   
}
void WiFiCallbackClass::SCANmode()
{
    // before scan you must change mode!
    if (WiFi.getMode() != APSTA)
    {
      WiFi.mode(WIFI_MODE_APSTA);
      WiFi.disconnect(); //potrebbe dare problemi
      delay(100);
    }
  
    NETnumber = WiFi.scanNetworks();
    Serial.println("[SCAN mode - WiFiCallback]");
}

//--------------------------------------------------------

// Check Internet connection
void CheckInternet()
{
  WiFiClient clientPing;
  
  // se il ping e' ok return 1
  if( clientPing.connect("www.google.com", 80) == 1 )
  {
    CheckStatus = CONNECTED;
    LinkStatus = LINK_WAN;
  }

  clientPing.stop();
}


//--------------------------------------------------------
// WiFiEvent_t event

