FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
void WiFiEvent(WiFiEvent_t event)
{
    switch(event) 
    {
      case SYSTEM_EVENT_AP_START:
      {
        Serial.println("[WiFiEvent] AP_START ");
        WiFi.softAP(APssid);

        LinkStatus = LINK_AP;
        
        break;
      }
      
      case SYSTEM_EVENT_AP_STOP:
      {
        Serial.println("[WiFiEvent] AP_STOP ");
        
        break;
      }

      case SYSTEM_EVENT_STA_START:
      {
        Serial.println("[WiFiEvent] STA_START ");
        CheckStatus = WAIT;
        
        break;
      }

      case SYSTEM_EVENT_STA_STOP:
      {
        Serial.println("[WiFiEvent] STA_STOP ");
        CheckStatus = FAILURE;
        
        break;
      }

      case SYSTEM_EVENT_AP_STADISCONNECTED:
      {
        Serial.println("[WiFiEvent] ESP_SoftAP disconnected ");
        break;
      }
      
      case SYSTEM_EVENT_AP_STACONNECTED:
      {
        Serial.println("[WiFiEvent] ESP_SoftAP connected with a Station ");
        break;
      }
      
      case SYSTEM_EVENT_STA_CONNECTED:
      {
        LinkStatus = LINK_STA;
        Serial.println("[WiFiEvent] ESP_STA connected with a HotSpot ");

        break;
      }

      case SYSTEM_EVENT_STA_GOT_IP:
      {
        Serial.println("[WiFiEvent] ESP_STA connected and GOT IP");
        Serial.print("[WiFiEvent] ESP_STA -> IP address: ");
        Serial.println(WiFi.localIP());

        CheckStatus = CONNECTED_NOWAN;

        CheckInternet();
        
        break;
      }
      
      case SYSTEM_EVENT_STA_DISCONNECTED:
      {
        // potresti aggiungere un retry della connessione wifi se lo perde

        Serial.println("[WiFiEventNew] ESP_STA HotSpot Signal lost ");

        WiFi.begin();
        WiFi.reconnect(); // Try reconnect

        CheckStatus = FAILURE;
        LinkStatus = LINK_NO;
        
        break;
      }


    }
}

//--------------------------------------------------------

void AP_SettingMode()
{
   
    // Check if a client has connected
    WiFiClient client = serverWIFI.available();
    if (!client) {
        return;
    }
    Serial.println("");
    Serial.println("New client");

    // Wait for data from client to become available
    while(client.connected() && !client.available()){
        delay(1);
    }

    // Read the first line of HTTP request
    String req = client.readStringUntil('\r');

    // First line of HTTP request looks like "GET /path HTTP/1.1"
    // Retrieve the "/path" part by finding the spaces
    int addr_start = req.indexOf(' ');
    int addr_end = req.indexOf(' ', addr_start + 1);
    
    if (addr_start == -1 || addr_end == -1) {
        Serial.print("Invalid request: ");
        Serial.println(req);
        return;
    }
    req = req.substring(addr_start + 1, addr_end);
    Serial.print("Request: ");
    Serial.println(req);
    client.flush();

    String req_one;
    String req_two;

    for (int i = 0; i < req.length(); i++)  // solo se c'e' il "?"
    {
      if (req.substring(i, i+1) == "?")
      {
        req_one = req.substring(0, i);
        req_two = req.substring(i);
         
        break;
      }
    }

    String page;
    
    if (req == "/")
    {
        page = FPSTR(HTTP_HEAD);
        page.replace("{v}", "Options");
        page.replace("{h}", "");
        page += FPSTR(HTTP_SCRIPT);
        page += FPSTR(HTTP_STYLE);
        page += FPSTR(HTTP_HEAD_END);
        page += F("<h3>FLUO WI-FI Configurator</h3>");
        page += FPSTR(HTTP_PORTAL_OPTIONS);
        page += FPSTR(HTTP_END);

        Serial.println("Sending 200 - End root");
    }
    
    else if(req == "/wifi")
    {   
        page = FPSTR(HTTP_HEAD);
        page.replace("{v}", "Choose WiFi Network");
        page.replace("{h}", "");
        page += FPSTR(HTTP_SCRIPT);
        page += FPSTR(HTTP_STYLE);
        page += FPSTR(HTTP_ENCR);
        page += FPSTR(HTTP_1BAR);
        page += FPSTR(HTTP_2BAR);
        page += FPSTR(HTTP_3BAR);
        page += FPSTR(HTTP_4BAR);
        
        page += FPSTR(HTTP_HEAD_END);

        // chiama la callback per lo scan
        WiFiCallback.SCANmode();

        if (NETnumber == 0) 
        {
          Serial.println("No networks found");
          page += F("No networks found. Refresh to scan again.");
        } 
        else 
        {
          
            //display networks in page
            for (int i = 0; i < NETnumber; ++i) 
            {
                
                String item = FPSTR(HTTP_ITEM);

                  item.replace("{v}", WiFi.SSID(i));
                  
                  if ( ComputeBar(WiFi.RSSI(i)) == 4)
                    item.replace("{b}", "ba"); // ba -> MAX
                  
                  if (ComputeBar(WiFi.RSSI(i)) == 3)
                    item.replace("{b}", "bb");
                  
                  if (ComputeBar(WiFi.RSSI(i)) == 2)
                    item.replace("{b}", "bc");
                  
                  if (ComputeBar(WiFi.RSSI(i)) == 1)
                    item.replace("{b}", "bd");
                  
                  if (WiFi.encryptionType(i) != WIFI_AUTH_OPEN) 
                    item.replace("{i}", "l");
                    
                  else 
                    item.replace("{i}", "");
                  
                Serial.println(item);
                page += item;
                
            }//for
      
            page += "<br/>";
        }

        page += FPSTR(HTTP_FORM_START);
         
        page += FPSTR(HTTP_FORM_END);
        page += FPSTR(HTTP_SCAN_LINK);
      
        page += FPSTR(HTTP_END);

        //At the end
        RefreshPageMode = 1; // questo riattiva la modalita' refresh per /wifisave
        oneshot = 0;
        RetryCount = 0;
        CheckStatus = WAIT;
      
        Serial.println("Sending 200 - End wifi");
    }
    
    else if (req_one == "/wifisave") // uso quella split (query con risposta) 
    {
      Serial.print("Inside - Request: ");
      Serial.println(req_two);

      delay(10);
      
      //Try to connecting ...
      if (oneshot == 0)
      {
        PopulateArgsArrey(string2char(req_two));

        delay(10);

