FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
        WiFiCallback.APSTAmode();
        
        oneshot = 1;
      }

      page = FPSTR(HTTP_HEAD);
      
      if (RefreshPageMode == 1) 
        page.replace("{h}", "<meta http-equiv=\"refresh\" content=\"2\">");
      else
        page.replace("{h}", "");


      page.replace("{v}", "WiFi Configuration Saved"); // si usa dopo che hai messo un segnaposto sul codice HTML
      
      page += FPSTR(HTTP_SCRIPT);
      page += FPSTR(HTTP_STYLE);
      page += FPSTR(HTTP_HEAD_END);

      if (RetryCount >= 7)
      {
        Serial.println("Retry Elapsed");
        page += FPSTR(HTTP_SAVED_FAILED);
        page.replace("{x}", "Timeout elapsed"); // gestire i vari casi, please
        RefreshPageMode = 0;
      } 
      
      else if (CheckStatus == FAILURE)
      {
        Serial.println("Failure");
        page += FPSTR(HTTP_SAVED_FAILED);
        page.replace("{x}", "Incorrect network name (SSID) or password"); // gestire i vari casi, please
        RefreshPageMode = 0;
      }   

      else if (CheckStatus == WAIT)
      {
        Serial.println("Wait");
        page += FPSTR(HTTP_SAVED_WAIT);
        page.replace("{bar}", String(RetryCount));
        RefreshPageMode = 1;

        RetryCount++;   
      }

      else if (CheckStatus == CONNECTED)
      {
        struct settings_t *struct_pointer_tmp = &settings;

        Serial.println("Success");  
        page += FPSTR(HTTP_SAVED_SUCCESS);
        page.replace("{a}", struct_pointer_tmp->ssid);

        if (LinkStatus == LINK_WAN)
            page.replace("{b}", "available");
        else
            page.replace("{b}", "<strong>not</strong> available");

        page.replace("{c}", struct_pointer_tmp->hostname);
        page.replace("{d}", WiFi.localIP().toString());
      
        RefreshPageMode = 0;
      }

      page += FPSTR(HTTP_END);

      /* FIX IT
      if (CheckStatus == CONNECTED_NOWAN)
      {
        page.replace("{x}", "Connected but Internet link is down ");
        // cambiare la modalita' - successo passo a only STA
        RefreshPageMode = 0;
      }

      if (CheckStatus == SSID_NOVALID)
      {
        page.replace("{x}", "SSID is not valid, Try to Reconnecting, click here <a href='/wifi'>link</a> to return on previous menu ");
        RefreshPageMode = 0;
      }

      if (CheckStatus == PASSKEY_NOVALID)
      {
        page.replace("{x}", "Passkey is not valid, Try to Reconnecting, click here <a href='/wifi'>link</a> to return on previous menu ");
        RefreshPageMode = 0;
      }
      */

    }

    else if (req == "/i")
    {
      char tmp[8];
      sprintf( tmp, "%04X",(uint16_t)(ESP.getEfuseMac() >> 32) );
      
      page = FPSTR(HTTP_HEAD);
      page.replace("{v}", "Info");
      page.replace("{h}", "");
      page += FPSTR(HTTP_SCRIPT);
      page += FPSTR(HTTP_STYLE);
      page += FPSTR(HTTP_HEAD_END);
      page += F("<dl>");
      page += F("<dt>Chip ID</dt><dd>");
      page += String(tmp);
      page += F("</dd>");
      page += F("<dt>IDE Flash Size</dt><dd>");
      page += ESP.getFlashChipSize();
      page += F(" bytes</dd>");
      page += F("<dt>Soft AP IP</dt><dd>");
      page += WiFi.softAPIP().toString();
      page += F("</dd>");
      page += F("<dt>Soft AP MAC</dt><dd>");
      page += WiFi.softAPmacAddress();
      page += F("</dd>");
      page += F("<dt>Station MAC</dt><dd>");
      page += WiFi.macAddress();
      page += F("</dd>");
      page += F("</dl>");
      page += FPSTR(HTTP_END);
    }
    
    else if (req == "/iot")
    {
        struct settings_t *struct_pointer_tmp = &settings;

        Serial.println("IoT mode enabled"); 

        page = FPSTR(HTTP_HEAD);
        page.replace("{v}", "Info");
        page.replace("{h}", "");
 
        page += FPSTR(HTTP_SAVED_IOT);
        page.replace("{a}", struct_pointer_tmp->ssid);

        if (LinkStatus == LINK_WAN)
            page.replace("{b}", "available");
        else
            page.replace("{b}", "<strong>not</strong> available");

        page.replace("{c}", struct_pointer_tmp->hostname);
        page.replace("{d}", WiFi.localIP().toString());

        page += FPSTR(HTTP_END);

        client.print(page);
        client.stop(); // prevent send page before change mode

        delay(5000);

        WiFiCallback.STAmode(); // only STA mode
        delay(1000);

    }

    else if (req == "/r")
    {
        page = FPSTR(HTTP_HEAD);
        page.replace("{v}", "Reset");
        page.replace("{h}", "");
        page += FPSTR(HTTP_SCRIPT);
        page += FPSTR(HTTP_STYLE);
        page += FPSTR(HTTP_HEAD_END);
        page += F("Module will reset in a few seconds.");
        page += FPSTR(HTTP_END);

        client.print(page); // force send page before restart
        
        delay(3000);
        ESP.restart();
    }
    
    else
    {
        page = FPSTR(HTTP_NOTFOUND);
        Serial.println("Sending 404");
    }

    client.print(page);

    Serial.println("Done with client");

}

// END AP MODE

// ________________________________________________________________________________________________

// START STA MODE

String CheckedOut(char c)
{

if (c == 'O')
    return "active";
else
    return "";
}
String CheckedIn(char c)
{

if (c == 'I')
    return "active";
else
    return "";
}
String CheckedServo(char c)
{

if (c == 'S')
    return "active";
else
    return "";
}
String CheckedPwm(char c)
{

if (c == 'P')
    return "active";
else
    return "";
}
String CheckedOn(String s)
{

if (s == "ON")
    return "active";
else
    return "";
}
String CheckedOff(String s)
{

if (s == "OFF")
    return "active";
else
    return "";
}





void handleNotFound(){

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += serverIoT.uri();
  message += "\nMethod: ";
  message += (serverIoT.method() == HTTP_GET)?"GET":"POST";
  message += "\nArguments: ";
  message += serverIoT.args();
  message += "\n";
  for (uint8_t i=0; i<serverIoT.args(); i++){
    message += " " + serverIoT.argName(i) + ": " + serverIoT.arg(i) + "\n";
  }
  serverIoT.send(404, "text/plain", message);
}


