FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
String getPage()
{

  struct AnalogGpioMap_t *Apointer;
  struct DigitalGpioMap_t *Dpointer; 

  String page = FPSTR(HTTP_IOT_HEADER);

  page += FPSTR(HTTP_IOT_SCRIPT);

  page += FPSTR(HTTP_IOT_STYLE);

  page += FPSTR(HTTP_IOT_TITLE);

  page += FPSTR(HTTP_IOT_ANALOG_ITEM);
  page += FPSTR(HTTP_IOT_ANALOG_TABLE);

  page += FPSTR(HTTP_IOT_ITEM_D0);
  page += FPSTR(HTTP_IOT_ITEM_D1);
  page += FPSTR(HTTP_IOT_ITEM_D2);
  page += FPSTR(HTTP_IOT_ITEM_D3);
  page += FPSTR(HTTP_IOT_ITEM_D4);
  page += FPSTR(HTTP_IOT_ITEM_D5);
  page += FPSTR(HTTP_IOT_ITEM_D6);
  page += FPSTR(HTTP_IOT_ITEM_D7);
  page += FPSTR(HTTP_IOT_ITEM_D8);
  page += FPSTR(HTTP_IOT_ITEM_D9);
  page += FPSTR(HTTP_IOT_ITEM_D10);
  page += FPSTR(HTTP_IOT_ITEM_D11);
  page += FPSTR(HTTP_IOT_ITEM_D12);
  page += FPSTR(HTTP_IOT_ITEM_D13);

  page += FPSTR(HTTP_IOT_CLOSE);

// modified page html

  Apointer = &AnalogGpioMap[0];

  page.replace( "{A0label}",   String(Apointer->label) );
  page.replace( "{A0value}",   String(Apointer->value) );
  page.replace( "{A0voltage}", String(Apointer->voltage) );

  Apointer = &AnalogGpioMap[1];

  page.replace( "{A1label}",   String(Apointer->label) );
  page.replace( "{A1value}",   String(Apointer->value) );
  page.replace( "{A1voltage}", String(Apointer->voltage) );

  Apointer = &AnalogGpioMap[2];

  page.replace( "{A2label}",   String(Apointer->label) );
  page.replace( "{A2value}",   String(Apointer->value) );
  page.replace( "{A2voltage}", String(Apointer->voltage) );

  Apointer = &AnalogGpioMap[3];

  page.replace( "{A3label}",   String(Apointer->label) );
  page.replace( "{A3value}",   String(Apointer->value) );
  page.replace( "{A3voltage}", String(Apointer->voltage) );

  Apointer = &AnalogGpioMap[4];

  page.replace( "{A4label}",   String(Apointer->label) );
  page.replace( "{A4value}",   String(Apointer->value) );
  page.replace( "{A4voltage}", String(Apointer->voltage) );

  Apointer = &AnalogGpioMap[5];

  page.replace( "{A5label}",   String(Apointer->label) );
  page.replace( "{A5value}",   String(Apointer->value) );
  page.replace( "{A5voltage}", String(Apointer->voltage) );

  // Digital
  Dpointer = &DigitalGpioMap[13];
        page.replace( "{D13Input}", String(Dpointer->value) );
        page.replace( "{D13label}", Dpointer->label );
        page.replace( "{D13set}"  , Dpointer->ReadyFunc );

        page.replace( "{D13on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D13off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D13outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D13incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D13servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D13pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[12];
        page.replace( "{D12Input}", String(Dpointer->value) );
        page.replace( "{D12label}", Dpointer->label );
        page.replace( "{D12set}"  , Dpointer->ReadyFunc );

        page.replace( "{D12on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D12off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D12outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D12incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D12servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D12pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[11];
        page.replace( "{D11Input}", String(Dpointer->value) );
        page.replace( "{D11label}", Dpointer->label );
        page.replace( "{D11set}"  , Dpointer->ReadyFunc );

        page.replace( "{D11on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D11off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D11outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D11incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D11servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D11pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[10];
        page.replace( "{D10Input}", String(Dpointer->value) );
        page.replace( "{D10label}", Dpointer->label );
        page.replace( "{D10set}"  , Dpointer->ReadyFunc );

        page.replace( "{D10on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D10off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D10outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D10incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D10servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D10pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[9];
        page.replace( "{D9Input}", String(Dpointer->value) );
        page.replace( "{D9label}", Dpointer->label );
        page.replace( "{D9set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D9on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D9off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D9outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D9incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D9servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D9pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[8];
        page.replace( "{D8Input}", String(Dpointer->value) );
        page.replace( "{D8label}", Dpointer->label );
        page.replace( "{D8set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D8on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D8off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D8outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D8incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D8servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D8pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[7];
        page.replace( "{D7Input}", String(Dpointer->value) );
        page.replace( "{D7label}", Dpointer->label );
        page.replace( "{D7set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D7on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D7off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D7outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D7incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D7servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D7pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[6];
        page.replace( "{D6Input}", String(Dpointer->value) );
        page.replace( "{D6label}", Dpointer->label );
        page.replace( "{D6set}" ,  Dpointer->ReadyFunc ); 

        page.replace( "{D6on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D6off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D6outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D6incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D6servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D6pwmcheck}" ,    CheckedPwm(Dpointer->mode) );       

