FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
  Dpointer = &DigitalGpioMap[5];
        page.replace( "{D5Input}", String(Dpointer->value) );
        page.replace( "{D5label}", Dpointer->label );
        page.replace( "{D5set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D5on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D5off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D5outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D5incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D5servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D5pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[4];
        page.replace( "{D4Input}", String(Dpointer->value) );
        page.replace( "{D4label}", Dpointer->label );
        page.replace( "{D4set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D4on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D4off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D4outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D4incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D4servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D4pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[3];
        page.replace( "{D3Input}", String(Dpointer->value) );
        page.replace( "{D3label}", Dpointer->label );
        page.replace( "{D3set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D3on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D3off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D3outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D3incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D3servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D3pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[2];
        page.replace( "{D2Input}", String(Dpointer->value) );
        page.replace( "{D2label}", Dpointer->label );
        page.replace( "{D2set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D2on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D2off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D2outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D2incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D2servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D2pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  Dpointer = &DigitalGpioMap[1];
        page.replace( "{D1Input}", String(Dpointer->value) );
        page.replace( "{D1label}", Dpointer->label );
        page.replace( "{D1set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D1on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D1off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D1outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D1incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D1servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D1pwmcheck}" ,    CheckedPwm(Dpointer->mode) );
    
  Dpointer = &DigitalGpioMap[0];
        page.replace( "{D0Input}", String(Dpointer->value) );
        page.replace( "{D0label}", Dpointer->label );
        page.replace( "{D0set}" ,  Dpointer->ReadyFunc );

        page.replace( "{D0on}" ,          CheckedOn(Dpointer->label) );
        page.replace( "{D0off}" ,         CheckedOff(Dpointer->label) );
        page.replace( "{D0outcheck}" ,    CheckedOut(Dpointer->mode) );
        page.replace( "{D0incheck}" ,     CheckedIn(Dpointer->mode) );
        page.replace( "{D0servocheck}" ,  CheckedServo(Dpointer->mode) );
        page.replace( "{D0pwmcheck}" ,    CheckedPwm(Dpointer->mode) );

  return page;
}



void updateGPIO(int gpio, String DxValue) 
{
    
  //Serial.println(""); DBG
  //Serial.println("Update GPIO "); Serial.print(gpio); Serial.print(" -> "); Serial.println(DxValue);
  
  if ( DxValue == "ON" ) 
  {

    VirtualpinMode(gpio, OUTPUT);
    VirtualdigitalWrite(gpio, HIGH);

    DigitalGpioMap[gpio].value = 1;
    DigitalGpioMap[gpio].mode = 'O';
    DigitalGpioMap[gpio].label = "ON";

    String str= "setMODE(" + String(gpio) + ", 0, 0);" ;
    DigitalGpioMap[gpio].ReadyFunc = str;

    serverIoT.send ( 200, "text/html", getPage() );
  } 
  else if ( DxValue == "OFF" ) 
  {

    VirtualpinMode(gpio, OUTPUT);
    VirtualdigitalWrite(gpio, LOW);

    DigitalGpioMap[gpio].value = 0;
    DigitalGpioMap[gpio].mode = 'O';
    DigitalGpioMap[gpio].label = "OFF";

    String str= "setMODE(" + String(gpio) + ",0,0);" ;
    DigitalGpioMap[gpio].ReadyFunc = str;

    serverIoT.send ( 200, "text/html", getPage() );
  }
  else if ( DxValue == "INPUT" ) 
  {

    VirtualpinMode(gpio, INPUT);

    DigitalGpioMap[gpio].value = VirtualdigitalRead(gpio);
    DigitalGpioMap[gpio].mode = 'I';
    DigitalGpioMap[gpio].label = "INPUT";

    String str= "setMODE(" + String(gpio) + ",1,0);" ;
    DigitalGpioMap[gpio].ReadyFunc = str;

    serverIoT.send ( 200, "text/html", getPage() );
  } 
  else if ( DxValue == "SERVO" ) 
  {
        
    DigitalGpioMap[gpio].value = 0;
    DigitalGpioMap[gpio].mode = 'S';
    DigitalGpioMap[gpio].label = "SERVO";

    String str= "setMODE(" + String(gpio) + ",2,0);" ;
    DigitalGpioMap[gpio].ReadyFunc = str;

    int s = serverIoT.arg("S").toInt();

    if( s > 0 && s < 181) // init
    {
        DigitalGpioMap[gpio].value = s;

        VirtualservoAttach(gpio);
        delay(10);
        VirtualservoWrite(gpio, s);
        delay(10);
        VirtualservoDetach(gpio);
    }
    else
    {
        VirtualservoAttach(gpio);
        delay(10);
        VirtualservoWrite(gpio, 0);
        delay(10);
        VirtualservoDetach(gpio);
    }

    serverIoT.send ( 200, "text/html", getPage() );
  }

  else if ( DxValue == "PWM" ) 
  {

    DigitalGpioMap[gpio].value = 0;
    DigitalGpioMap[gpio].mode = 'P';
    DigitalGpioMap[gpio].label = "PWM";

