FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
    String str= "setMODE(" + String(gpio) + ",3,0);" ;
    DigitalGpioMap[gpio].ReadyFunc = str;

    int p = serverIoT.arg("P").toInt();

    if ( p > 0 && p < 256)
    {
        DigitalGpioMap[gpio].value = p;
        VirtualanalogWrite(gpio, p);
    }
    else // init sara' 0
    {
        VirtualanalogWrite(gpio, 0);
    }

    serverIoT.send ( 200, "text/html", getPage() );
  } 

  else 
  {
    Serial.println("Args Error");
  } 

}


void handleRoot(){ 
  if ( serverIoT.hasArg("D0") ) 
      updateGPIO(0, serverIoT.arg("D0"));
  else if ( serverIoT.hasArg("D1") ) 
      updateGPIO(1, serverIoT.arg("D1"));
  else if ( serverIoT.hasArg("D2") ) 
      updateGPIO(2, serverIoT.arg("D2"));
  else if ( serverIoT.hasArg("D3") ) 
      updateGPIO(3, serverIoT.arg("D3"));
  else if ( serverIoT.hasArg("D4") ) 
      updateGPIO(4, serverIoT.arg("D4"));
  else if ( serverIoT.hasArg("D5") ) 
      updateGPIO(5, serverIoT.arg("D5"));
  else if ( serverIoT.hasArg("D6") ) 
      updateGPIO(6, serverIoT.arg("D6"));
  else if ( serverIoT.hasArg("D7") ) 
      updateGPIO(7, serverIoT.arg("D7"));
  else if ( serverIoT.hasArg("D8") ) 
      updateGPIO(8, serverIoT.arg("D8"));
  else if ( serverIoT.hasArg("D9") ) 
      updateGPIO(9, serverIoT.arg("D9"));
  else if ( serverIoT.hasArg("D10") ) 
      updateGPIO(10, serverIoT.arg("D10"));
  else if ( serverIoT.hasArg("D11") ) 
      updateGPIO(11, serverIoT.arg("D11"));
  else if ( serverIoT.hasArg("D12") ) 
      updateGPIO(12, serverIoT.arg("D12"));
  else if ( serverIoT.hasArg("D13") ) 
      updateGPIO(13, serverIoT.arg("D13"));
  else 
      serverIoT.send ( 200, "text/html", getPage() );

}


#if 1 //test per SD CARD
void STA_SettingMode()
{ 

static byte oneshot;

if (!oneshot)
{

    serverIoT.on("/", handleRoot);

    serverIoT.on("/inline", [](){
    serverIoT.send(200, "text/plain", "this works as well");
    });

    serverIoT.onNotFound(handleNotFound);

    serverIoT.begin();

    // Init Label GPIO Map
    for(int i=0; i < 14; i++)
    {
        DigitalGpioMap[i].label = "OFF";
        DigitalGpioMap[i].value = 0;
        DigitalGpioMap[i].mode = 'O';
        
        String str= "setMODE(" + String(i) + ",0,0);" ;
        DigitalGpioMap[i].ReadyFunc = str ;
    }

    oneshot = 1; 
}

//loop
serverIoT.handleClient();

}

#else

bool loadFromSdCard(String path){
  String dataType = "text/plain";
  if(path.endsWith("/")) path += "index.htm";

  if(path.endsWith(".src")) path = path.substring(0, path.lastIndexOf("."));
  else if(path.endsWith(".htm")) dataType = "text/html";
  else if(path.endsWith(".css")) dataType = "text/css";
  else if(path.endsWith(".js")) dataType = "application/javascript";
  else if(path.endsWith(".png")) dataType = "image/png";
  else if(path.endsWith(".gif")) dataType = "image/gif";
  else if(path.endsWith(".jpg")) dataType = "image/jpeg";
  else if(path.endsWith(".ico")) dataType = "image/x-icon";
  else if(path.endsWith(".xml")) dataType = "text/xml";
  else if(path.endsWith(".pdf")) dataType = "application/pdf";
  else if(path.endsWith(".zip")) dataType = "application/zip";

  File dataFile = WrapOpen(SD, path.c_str());
  
  if(dataFile.isDirectory()){
    path += "/index.htm";
    dataType = "text/html";
    dataFile = WrapOpen(SD, path.c_str());
  }

  if (!dataFile)
    return false;

  //if (server.hasArg("download")) dataType = "application/octet-stream";

  if (serverIoT.streamFile(dataFile, dataType) != dataFile.size()) {
    Serial.println("Sent less data than expected!");
  }

  dataFile.close();
  return true;
}

void handleNotFound(){

  if(cardSize && loadFromSdCard(serverIoT.uri())) return;
  String message = "SDCARD Not Detected\n\n";
  message += "URI: ";
  message += serverIoT.uri();
  message += "\nMethod: ";
  message += (serverIoT.method() == HTTP_GET)?"GET":"POST";
  message += "\nArguments: ";
  message += serverIoT.args();
  message += "\n";
  for (uint8_t i=0; i<serverIoT.args(); i++){
    message += " NAME:"+serverIoT.argName(i) + "\n VALUE:" + serverIoT.arg(i) + "\n";
  }
  serverIoT.send(404, "text/plain", message);
  Serial.print(message);

}


void STA_SettingMode()
{ 

static byte oneshot;

    if (!oneshot)
    {
        //server.close();

        //serverIoT.on("/", handleRootSUKA); //x ora no
        serverIoT.onNotFound(handleNotFoundSUKA);

        serverIoT.begin();

        oneshot = 1; 
    }

//loop
serverIoT.handleClient();

}

#endif


// END STA MODE

// ________________________________________________________________________________________________

// START MANUAL MODE

void MANUAL_SettingMode()
{ 

static byte oneshot;

if (!oneshot)
{
    serverMANUAL.onNotFound(RESThandle);
    serverMANUAL.begin();
    oneshot = 1; 
}

//loop
serverMANUAL.handleClient();

}


void RESThandle()
{
    // Check if a client has connected
    String message = "";
    message += "URI: ";
    message += serverMANUAL.uri();
    message += "\nMethod: ";
    message += (serverMANUAL.method() == HTTP_GET)?"GET":"POST";
    message += "\nArguments: ";
    message += serverMANUAL.args();
    message += "\n";

    for (uint8_t i=0; i<serverMANUAL.args(); i++){
        message += " " + serverMANUAL.argName(i) + ": " + serverMANUAL.arg(i) + "\n";
    }

    serverMANUAL.send(200, "text/plain", message);
    
    // invio la stringa al 664p
    VirtualStringSend(serverMANUAL.uri());

}


































int ComputeBar(int value) 
{
  int quality = 0;

  value = abs(value);

  if (value <= 100 && value >= 91) 
    quality = 1;
  else if (value <= 90 && value >= 80) 
    quality = 2;

  else if (value <= 79 && value >= 60) 
    quality = 3;
  else 
    quality = 4;
  
  return quality;
}


void PopulateArgsArrey(char *str)
{
  char * pch;
  int i = 0;
  pch = strtok (str,"=");
  
  while (pch != NULL)
  {
    pch = strtok (NULL, "=");
    Serial.println(pch); 
    if(i == 0)
    {
      WifisaveArg[i].key = 's';
      pch[strlen(pch)-2] = 0;
      WifisaveArg[i].value = pch;
    }     
    if(i == 1)
    {
      WifisaveArg[i].key = 'p';
      pch[strlen(pch)-2] = 0;
      WifisaveArg[i].value = pch;
    }     
    if(i == 2)
    {
      WifisaveArg[i].key = 'g';
      WifisaveArg[i].value = pch;
    }
    i++;
  }

