FluoTechnology/FLUO_IOT/esp32/libraries/FluoTube/src/Fluoweb.cpp
    struct Args *argsOne   = &WifisaveArg[0];
    struct Args *argsTwo   = &WifisaveArg[1];
    struct Args *argsThree = &WifisaveArg[2];

    strncpy(settings.ssid, argsOne->value, strlen(argsOne->value));
    settings.ssid[strlen(argsOne->value)] = '\0';

    strncpy(settings.password, argsTwo->value, strlen(argsTwo->value));
    settings.password[strlen(argsTwo->value)] = '\0';

    strncpy(settings.hostname, argsThree->value, strlen(argsThree->value));
    settings.hostname[strlen(argsThree->value)] = '\0';

}

void ReadSetting( struct settings_t *set ) 
{
    Serial.print("IoT mode : ");
    Serial.println(set->IoTMode);

    Serial.print("SSID : ");
    Serial.println(set->ssid);

    Serial.print("Password : ");
    Serial.println(set->password);

    Serial.print("Hostname : ");
    Serial.println(set->hostname);

    Serial.println("");
}

void storeStruct(void *data_source, size_t size)
{
  EEPROM.begin(size * 2);
  for(size_t i = 0; i < size; i++)
  {
    char data = ((char *)data_source)[i];
    EEPROM.write(i, data);
  }
  EEPROM.commit();
}

void loadStruct(void *data_dest, size_t size)
{
    EEPROM.begin(size * 2);
    for(size_t i = 0; i < size; i++)
    {
        char data = EEPROM.read(i);
        ((char *)data_dest)[i] = data;
    }
}


int AnalogIndex = 24;

void Task644ReadInput()
{
    // legge un ADC ogni secondo in ciclo continuo...

    // Analog
    int j;
    static int shoot; 

    // ManualMode -- se e' 1 0 2 allora ritorna
    MMMode = VirtualUseCase();
    if (MMMode != 0)  
        return;

    if (shoot == 0) // only for test (oneshot)
        shoot = VirtualMacADDR( WiFi.macAddress() );

    // ADC
    j = (AnalogIndex - 24);

    String label;
        label += "A";
        label += String(j);
        
    AnalogGpioMap[j].value = VirtualanalogRead(AnalogIndex);
    AnalogGpioMap[j].label = label; 

    serverIoT.handleClient();   // force Webserver Handle

    AnalogGpioMap[j].voltage = 0; // else condition
        
    // Convert the analog reading (which goes from 0 - 1023) to a voltage (0 - 5V):
    if (AnalogGpioMap[j].value > 0)
        AnalogGpioMap[j].voltage = AnalogGpioMap[j].value * (0.0048875855); //(5.0 / 1023.0)

    AnalogIndex++;

    if (AnalogIndex == 30)
        AnalogIndex = 24; // count restart 

    // Digital
    for(int i = 0; i < 14; i++)
    {
        if (DigitalGpioMap[i].mode == 'I')
        {
            DigitalGpioMap[i].value = VirtualdigitalRead(i);
            serverIoT.handleClient();   // force Webserver Handle
        }
    }

}